package com.example.app_4

import android.app.Activity
import android.content.Intent
import android.content.SharedPreferences
import android.os.Bundle
import androidx.activity.ComponentActivity
import androidx.activity.compose.setContent
import androidx.activity.enableEdgeToEdge
import androidx.compose.foundation.background
import androidx.compose.foundation.clickable
import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.PaddingValues
import androidx.compose.foundation.layout.Row
import androidx.compose.foundation.layout.fillMaxSize
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.foundation.layout.height
import androidx.compose.foundation.layout.padding
import androidx.compose.foundation.layout.width
import androidx.compose.foundation.lazy.LazyColumn
import androidx.compose.material.icons.Icons
import androidx.compose.material.icons.automirrored.filled.ArrowBack
import androidx.compose.material3.CenterAlignedTopAppBar
import androidx.compose.material3.ExperimentalMaterial3Api
import androidx.compose.material3.Icon
import androidx.compose.material3.IconButton
import androidx.compose.material3.Scaffold
import androidx.compose.material3.Text
import androidx.compose.material3.TopAppBarDefaults
import androidx.compose.runtime.getValue
import androidx.compose.runtime.mutableStateOf
import androidx.compose.runtime.remember
import androidx.compose.runtime.setValue
import androidx.compose.ui.Modifier
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.platform.LocalContext
import androidx.compose.ui.text.font.Font
import androidx.compose.ui.text.font.FontFamily
import androidx.compose.ui.unit.dp
import androidx.compose.ui.unit.sp
import com.example.app_4.ui.theme.App4Theme
import com.example.app_4.ui.theme.Button1
import com.example.app_4.ui.theme.CopyShareWhatsApp
import androidx.core.content.edit


class MainActivity2 : ComponentActivity() {

    private val sp: SharedPreferences by lazy {
        getSharedPreferences("favorite_shayari", MODE_PRIVATE)
    }
    private lateinit var favoriteShayari: HashSet<String>


    @OptIn(ExperimentalMaterial3Api::class)
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        enableEdgeToEdge()
        setContent {
            App4Theme {

                val context = LocalContext.current
                favoriteShayari = HashSet(sp.getStringSet("fshayari", hashSetOf<String>())!!)

                val category = intent.getStringExtra("category") ?: "Not Found"

                Scaffold(topBar = {
                    CenterAlignedTopAppBar(
                        title = {
                            Text(
                                text = category,
                                fontFamily = FontFamily(Font(R.font.amita_bold)),
                                fontSize = 30.sp,
                                color = Color(0xE1CB2092)
                            )
                        }, navigationIcon = {
                            IconButton(onClick = {
                                (context as? Activity)?.finish()
                            }) {
                                Icon(
                                    modifier = Modifier
                                        .height(30.dp)
                                        .width(30.dp),
                                    imageVector = Icons.AutoMirrored.Filled.ArrowBack,
                                    contentDescription = ""
                                )
                            }
                        }, colors = TopAppBarDefaults.topAppBarColors(
                            containerColor = Color(0xD577D5B2)
                        )
                    )
                }) { innerPadding ->

                    Column(modifier = Modifier.padding(innerPadding)) {

                        var shayari = emptyArray<String>()

                        val premShayari = arrayOf(
                            " तुम्हारे बिना ये जिंदगी अधूरी सी लगती है,\n   हर पल तुझसे मिलने की ख्वाहिश मन में बसी है,\n   तेरी यादों में खो जाने का मन करता है,\n   तुम हो तो हर दर्द और ग़म भी खुशी सा लगता है।",
                            " तेरे बिना हर चीज़ फीकी सी लगती है,\n   तेरे आने से मेरी दुनिया रोशन हो जाती है,\n   तुझे देखूं तो दिन ही अच्छा लगने लगता है,\n   तू है तो मुझे किसी और चीज़ की कमी नहीं लगती।",
                            " दिल में तेरी एक छवि बसी रहती है,\n   तेरी यादों की खुशबू मेरे पास रहती है,\n   तुमसे बढ़कर कोई नहीं है इस दुनिया में,\n   तुम्हारे बिना ये दुनिया फीकी सी लगती है।",
                            " तेरे चेहरे की मुस्कान है जो, दिन को रोशन करती है,\n   तेरी बातों में वो जादू है, जो रात को सुकून देती है,\n   तेरे साथ बिताया हर पल अब तकिये में समेट कर रखता हूँ,\n   मुझे तुझसे हर ख्वाहिश, हर अरमान है।",
                            " तुमसे मिलने के बाद महसूस हुआ है,\n   प्यार ही सच्चा एहसास है इस जीवन में,\n   तुम हो तो मैं हर मुश्किल को पार कर सकता हूँ,\n   तुम्हारी हंसी मेरे दिल में गूंजती रहती है।",
                            " प्यार में हमें कभी भी डर नहीं होना चाहिए,\n   तुम मेरे साथ हो, तो मुझे किसी से नहीं डरना चाहिए,\n   तुम हो तो जिंदगी में खुशियों का रंग है,\n   तुम्हारे बिना कोई रंग नहीं लगता है।",
                            " तेरी आँखों में जो सुकून है, वो मुझे खो जाने देता है,\n   तुझसे दूर जाने का ख्याल भी दिल को कभी नहीं आता है,\n   तुम हो तो हर एक रास्ता रोशन हो जाता है,\n   तुमसे ज्यादा प्यारा कुछ भी नहीं है इस जीवन में।",
                            " तुम मेरी सुबह हो, तुम मेरी रात हो,\n   मेरी धड़कन में बस तुम ही की बात हो,\n   तुमसे ही तो मेरे अरमान जुड़े हैं,\n   तुम हो तो मेरी जिंदगी में रंग भरे हैं।",
                            " तेरे साथ बिताए पल जैसे यादों का खजाना है,\n   तुझे देखे बिना अब हर दिन सुना सा लगता है,\n   तेरी आवाज़ में जो मिठास है, वो दिल को सुकून देती है,\n   तेरे बिना तो हर चीज़ अधूरी सी लगती है।",
                            " तुम हो तो हर रोज़ एक नई सुबह हो,\n   तुम्हारे बिना तो शाम भी रात जैसी हो,\n   तुमसे ही तो मेरे दिन रोशन हैं,\n   तुम हो तो मेरी पूरी दुनिया रोशन हो।"
                        )
                        val dukhShayari = arrayOf(
                            " जब भी मुस्कुराने की कोशिश करता हूँ,\n   तब तब तेरी यादें रुला जाती हैं,\n   ये जो हँसी चेहरे पर दिखती है,\n   इसके पीछे कई रातों की तन्हाई छिपी है।",
                            " दर्द वो नहीं जो आँखों से बहता है,\n   दर्द वो है जो दिल में चुपचाप सहता है,\n   कुछ कह नहीं सकते, बस जीते हैं,\n   इस अधूरे से जीवन को धीरे-धीरे पीते हैं।",
                            " कोई पूछे तो कह देता हूँ ठीक हूँ,\n   पर दिल अंदर से बहुत टूटा हुआ है,\n   जिस पर सबसे ज़्यादा भरोसा किया,\n   उसी ने अकेलेपन में मुझे छोड़ा हुआ है।",
                            " किस्मत भी अजीब खेल खेलती है,\n   जो पास नहीं होता उसी की यादें देती है,\n   जीते हैं सिर्फ सांसें लेकर,\n   वरना हमारी रूह तो कब की मर चुकी होती है।",
                            " ज़िंदगी से कोई शिकवा नहीं था,\n   जब तक तुझे खोने का ग़म नहीं था,\n   अब तो हर खुशी भी दर्द देती है,\n   क्योंकि उसमें तेरा साथ नहीं होता।",
                            " जो दिल में था वो जुबां पर न आया,\n   हमने हर दर्द अकेले ही पाया,\n   अब तो आदत हो गई है तन्हा जीने की,\n   क्योंकि हर अपना हमें पराया ही नज़र आया।",
                            " हर पल तेरा इंतज़ार करते हैं,\n   हर सुबह तुझसे मिलने की दुआ करते हैं,\n   कोई समझे ना समझे इस दिल को,\n   हम तो बस तुझसे ही बेपनाह मोहब्बत करते हैं।",
                            " खुश रहने की कोशिश की थी बहुत,\n   पर ये मुस्कान भी झूठी सी लगती है,\n   दिल अब किसी पर भरोसा नहीं करता,\n   क्योंकि अपनों से ही सबसे ज़्यादा चोट मिलती है।",
                            " आँसू थम भी जाएँ तो क्या,\n   दर्द तो अब साँसों में बस गया है,\n   हर खुशी अब सवाल लगती है,\n   जब से तेरा साथ छूट गया है।",
                            " टूटा हूँ लेकिन बिखरा नहीं हूँ,\n    खुद से लड़ता हूँ मगर हारा नहीं हूँ,\n    तेरे जाने के बाद समझ आया,\n    कि सच्चा दर्द क्या होता है जिंदगी में।"
                        )
                        val romanticShayari = arrayOf(
                            " तेरी हर अदा पर हमें प्यार आता है,\n   तुझसे मिलने को दिल बेक़रार रहता है,\n   तुझसे दूर रहकर भी लगता है यूँ,\n   जैसे तू हर वक्त मेरे साथ रहता है।",
                            " तेरे बिना ये दिल अधूरा सा लगता है,\n   तेरे बिना हर लम्हा सुना सा लगता है,\n   तुझसे मिलकर ही तो जिंदा हूँ मैं,\n   वरना जीना भी अब सज़ा सा लगता है।",
                            " तुम पास होते हो तो सब कुछ अच्छा लगता है,\n   तुम्हारी हँसी में खुदा का नूर लगता है,\n   छू ले जो तेरी मोहब्बत का एहसास,\n   वो हर घड़ी एक जादू सा लगता है।",
                            " तेरे इश्क़ में हर शाम सुनहरी लगती है,\n   तुझसे बात करने को हर घड़ी बहारी लगती है,\n   जो ख्वाब तुझसे जुड़े हों मेरे,\n   उन्हें हकीकत बनाना ज़रूरी लगती है।",
                            " तुझसे नज़रे मिलाते ही दिल बहक जाता है,\n   हर धड़कन में तेरा ही नाम आता है,\n   ये मोहब्बत नहीं तो क्या है,\n   जो हर वक्त बस तुझमें ही खो जाता है।",
                            " जब भी तुझे पास पाता हूँ,\n   खुद को सबसे खुशनसीब पाता हूँ,\n   तुझमें ही बसी है मेरी दुनिया,\n   तुझे देखकर ही हर ग़म भूल जाता हूँ।",
                            " तेरा नाम लबों पर जब भी आता है,\n   दिल बेवजह मुस्कुराता है,\n   तू जो है तो सब कुछ है,\n   तेरे बिना कुछ भी अधूरा नज़र आता है।",
                            " तेरा साथ हो तो हर मौसम हसीं लगता है,\n   तेरे बिना हर दिन सूनापन सा लगता है,\n   तुमसे मिलना जैसे ख्वाबों का सच होना,\n   तुम्हारे बिना हर सपना अधूरा लगता है।",
                            " तुम्हारी बातों में वो मिठास है,\n   जो हर दर्द को भुला देती है,\n   तेरी आँखों में डूब जाने का मन करता है,\n   वो नजरें दिल को सुकून दे जाती हैं।",
                            " तुझसे ही शुरू होती है मेरी हर सुबह,\n    तेरे नाम पर ही होती है हर रात खत्म,\n    तू ना हो तो वक्त रुक सा जाता है,\n    तू हो तो हर घड़ी खास बन जाती है।"
                        )
                        val dostiShayari = arrayOf(
                            " दोस्ती वो नहीं जो जान देती है,\n   दोस्ती वो नहीं जो मुस्कान देती है,\n   असली दोस्ती तो वो होती है,\n   जो पानी में गिरा आँसू भी पहचान लेती है।",
                            " सच्चा दोस्त मिलना बहुत मुश्किल होता है,\n   मैं खुद हैरान हूँ कि तू मुझसे कैसे मिल गया,\n   तेरी दोस्ती का एहसान जिंदगी भर रहेगा,\n   क्योंकि तू ही है जो हर मोड़ पर मेरे साथ खड़ा रहा।",
                            " ना कोई दिन, ना कोई बात खास होती है,\n   जब अपने दोस्त साथ होते हैं,\n   हर ग़म आसान हो जाता है,\n   जब दिल से दिल की बात होती है।",
                            " दोस्ती हर चेहरा मुस्कान बना देती है,\n   दोस्ती हर राह आसान बना देती है,\n   जब जिंदगी में कोई दोस्त मिल जाए सच्चा,\n   तो किस्मत भी अपनी पहचान बना देती है।",
                            " नज़रों से दूर पर दिल के पास रहते हो,\n   हर पल मुझे अपनी यादों में बसाए रखते हो,\n   दोस्ती का रिश्ता यूँ ही बना रहे,\n   बस यही दुआ हम रोज़ खुदा से करते हैं।",
                            " दोस्ती कोई किताब नहीं जो हर कोई पढ़ ले,\n   ये वो अहसास है जो हर किसी को नहीं मिलता,\n   जो साथ हो हर खुशी और ग़म में,\n   वही तो असली यार होता है।",
                            " जब कोई नहीं होता साथ,\n   तब भी होते हैं दोस्त हमारे पास,\n   दिल की हर बात वो समझ जाते हैं,\n   बिना कहे ही सब कुछ जान जाते हैं।",
                            " ज़िन्दगी हर पल कुछ खास नहीं होती,\n   फूलों की खुशबू हमेशा पास नहीं होती,\n   मिलना हमारी तक़दीर में था वरना,\n   इतनी प्यारी दोस्ती यूँ ही आम नहीं होती।",
                            " हर मुश्किल में साथ निभाते हैं दोस्त,\n   हर खुशी में पहले याद आते हैं दोस्त,\n   क्या खूब रिश्ता है दोस्ती का,\n   जो बिना खून के भी अपना बन जाते हैं दोस्त।",
                            " तेरी दोस्ती ने जीना सिखा दिया,\n    हर लम्हा खुश रहना सिखा दिया,\n    क्या खूब एहसास है तेरी यारी का,\n    जिसने मुझे खुद से मिलवा दिया।"
                        )
                        val krantikariShayari = arrayOf(
                            " सरफ़रोशी की तमन्ना अब हमारे दिल में है,\n   देखना है ज़ोर कितना बाज़ू-ए-क़ातिल में है,\n   वक्त आने दे बता देंगे तुझे ए आसमान,\n   हम अभी से क्या बताएं क्या हमारे दिल में है।",
                            " जंजीरों से डर नहीं लगता हमें,\n   हम वो हैं जो आग से खेलते हैं,\n   क्रांति की ज्वाला हैं हम,\n   जो अन्याय देख चुप नहीं रहते हैं।",
                            " मैं अकेला ही चला था जानिब-ए-मंज़िल मगर,\n   लोग साथ आते गए और कारवाँ बनता गया,\n   इंकलाब की राह में जो बढ़ते हैं,\n   उन्हें कोई डर नहीं रोकता है।",
                            " बंदूक नहीं किताब उठाओ,\n   अब नया इतिहास बनाओ,\n   क्रांति सिर्फ खून से नहीं होती,\n   विचारों से भी परिवर्तन लाओ।",
                            " हमें शहीदों की तरह जीना है,\n   अब न झुकना है न पीछे हटना है,\n   जो देश के लिए मरते हैं,\n   वही असली वीर कहलाते हैं।",
                            " हर ज़ुल्म के खिलाफ आवाज़ उठाओ,\n   इंसाफ़ का सूरज फिर से चमकाओ,\n   सोई हुई जनता को जगा दो,\n   एक नई क्रांति की लौ जलाओ।",
                            " लहू जब तक न खौले, वो जवानी किस काम की,\n   जो देश के काम न आए, वो कहानी किस काम की,\n   उठो, जागो और क्रांति का बिगुल बजाओ,\n   अन्याय की जड़ें अब जला दो।",
                            " सच्ची क्रांति तलवार नहीं मांगती,\n   ये तो बस ईमानदार विचार मांगती,\n   अगर इरादे नेक हों दिल से,\n   तो हर जंजीर खुद टूट जाती।",
                            " परिवर्तन की आंधी चलने दो,\n   हर अन्याय को अब जलने दो,\n   उठो, अब समय है बदलाव का,\n   इस सोई भीड़ को कुछ करने दो।",
                            " देशभक्ति हो अगर दिल में,\n    तो डर कैसा हो मंज़िल में,\n    तूफानों से टकराना है,\n    अब भारत को फिर से जगाना है।"
                        )
                        val attitudeShayari = arrayOf(
                            " हमारे जीने का तरीका थोड़ा अलग है,\n   हम उमीद पर नहीं अपनी ज़िद पर जीते हैं,\n   जहां तक बात है ज़िंदगी की,\n   तो हर एक पल अपनी शर्तों पर जीते हैं।",
                            " हमसे जलने वाले भी कमाल करते हैं,\n   महफ़िलें खुद की सजाते हैं और चर्चे हमारे करते हैं,\n   स्टाइल ऐसा है कि धूप में भी छाँव लगे,\n   और एटिट्यूड ऐसा कि देख के भी नज़रें झुक जाएँ।",
                            " शेर अपना शिकार खुद करता है,\n   हम भी अपने अंदाज़ में जीते हैं,\n   नाम और पहचान की क्या जरूरत,\n   जब लोग चेहरे से ही डरते हैं।",
                            " तमीज़ में रहो वरना जो हमारी आँखों में खटकता है,\n   वो अगले ही पल ज़मीन पर दिखता है,\n   हम वहां खड़े होते हैं जहाँ बात इज्ज़त की हो,\n   वरना भीड़ में शामिल होना हमारी फ़ितरत नहीं।",
                            " बात अगर शान की है,\n   तो अपना एटिट्यूड ही काफी है,\n   सामने वाला भी सोच में पड़ जाए,\n   कि ये बंदा है या तूफ़ान की आहट।",
                            " हमारे दुश्मन भी हमारी मुस्कान से डरते हैं,\n   क्योंकि हम दर्द में भी स्टाइल से जीते हैं,\n   ये मत समझना कि कमजोर हैं हम,\n   बस लोगों को इग्नोर करना हमारी आदत में है।",
                            " हम वो खेल नहीं खेलते,\n   जिसमें जीतना तय हो,\n   क्योंकि खेल का मज़ा तब है,\n   जब हारने वाला भी दिल से कहे — 'क्या बंदा है!'",
                            " जलते हैं तो जलने दो,\n   बुझाने का शौक नहीं हमें,\n   जो हमसे टकराए,\n   उसकी औकात दिखा देते हैं हम।",
                            " हमारा अंदाज़ ही कुछ ऐसा है,\n   जिसे देखकर अच्छे-अच्छों का घमंड टूट जाता है,\n   हम वहाँ कदम रखते हैं,\n   जहाँ लोग सोचते ही रह जाते हैं।",
                            " नजर झुकी तो समझ लेना गुरूर में हूँ,\n    वरना मुस्कराकर मिलना भी आता है,\n    वक्त देखकर नहीं,\n    हम तो हालत देखकर चाल बदलते हैं।"
                        )
                        val preranaShayari = arrayOf(
                            " जो मंजिलों को पाने की चाह रखते हैं,\n   वो समंदरों पर भी राह रखते हैं,\n   तूफानों से आंख मिलाकर चलते हैं जो,\n   वही इस जहां में नाम रखते हैं।",
                            " मुश्किलों से भाग जाना आसान होता है,\n   हर पहलू ज़िंदगी का इम्तिहान होता है,\n   डरने वालों को कुछ नहीं मिलता जिंदगी में,\n   और लड़ने वालों के कदमों में जहां होता है।",
                            " हार मान लेना सबसे बड़ी हार है,\n   कोशिश करने वालों की जीत अपार है,\n   थक कर बैठ जाना मंजिल नहीं होती,\n   चलते रहो यही तो सच्ची राह है।",
                            " जिंदगी एक किताब की तरह होती है,\n   हर पन्ना कुछ कहता है,\n   जो गिर कर भी मुस्कुरा सके,\n   वही इंसान सबसे बेहतर रहता है।",
                            " उठो तो ऐसे उठो कि फक्र हो बुलंदी को,\n   चलो तो ऐसे चलो कि कांपे खुदा भी रफ़्तार से,\n   मंजिल खुद चलकर आएगी कदमों में,\n   अगर इरादा हो आसमान छूने का यार से।",
                            " जो ख्वाब देखे हैं, उन्हें पूरा करो,\n   हर दर्द को अपना हथियार बना लो,\n   अगर सोच हो बुलंद तो अकेला ही काफी है,\n   अपनी दुनिया खुद सजा लो।",
                            " सूरज बन कर तपना है,\n   अंधेरों को खुद मिटाना है,\n   कांटों से डर कर क्या जीना,\n   अब तो रास्ता खुद बनाना है।",
                            " मत सोचो क्या खोया क्या पाया,\n   जो किया अच्छा किया,\n   बस आगे बढ़ते जाओ जिंदगी में,\n   हर दिन कुछ नया किया।",
                            " कोई तुम्हारे रास्ते रोके,\n   तो मत झुको, बस बढ़ते रहो,\n   जो लोग आज हँसते हैं तुम पर,\n   कल तालियाँ वही बजाएँगे तुम्हारे लिए।",
                            " मत रुक, थक कर बैठा नहीं करते,\n    वक्त हर किसी का आता है,\n    तू खुद पर विश्वास रख,\n    इतिहास वही रचते हैं जो हार नहीं मानते।"
                        )
                        val hasiMazaakShayari = arrayOf(
                            " चेहरे पर हंसी, दिल में खुशी,\n   हर ग़म से रहे दूर ज़िंदगी की ज़िंदगी,\n   हँसते रहो तुम यूँ ही हमेशा,\n   क्योंकि हँसी है सबसे बड़ी दौलत सच्ची।",
                            " डॉक्टर ने कहा – दवा से आराम मिलेगा,\n   हमने कहा – दोस्तो से मुलाकात हो गई,\n   अब तो बिना दवा ही ठीक हो गया,\n   ये है यारी की असली रासायनिक क्रिया।",
                            " कुछ लोग इतने सीधे होते हैं,\n   कि सीधी लाइन भी उनसे टेढ़ी लगती है,\n   और कुछ लोग इतने हँसाने वाले होते हैं,\n   कि ग़म भी खुद शर्मा कर छुप जाते हैं।",
                            " लड़कियाँ भी कमाल करती हैं,\n   फेसबुक पर फ़ोटो ऐसी लगाती हैं,\n   जैसे अभी-अभी किसी ऐड से निकलकर आई हों,\n   और असल में... भगवान बचाए हमें!",
                            " टीचर – बताओ 2 और 2 कितने होते हैं?\n   स्टूडेंट – 4 तो होते हैं,\n   लेकिन अगर लड़की पूछे तो 5 भी कह देते हैं,\n   ताकि बात आगे बढ़े।",
                            " जब भी हम हँसते हैं,\n   लोग कहते हैं पागल हो क्या?\n   अब उनको कौन समझाए,\n   पागलपन ही तो हमारी पहचान है भैया!",
                            " पढ़ाई ऐसी चीज़ है,\n   जो शुरू होते ही नींद आ जाती है,\n   और अगर किताब तकिया हो,\n   तो सपने भी बहुत शुद्ध आते हैं।",
                            " मोहब्बत के नाम पर धोखा बहुत हुआ,\n   अब तो चाय से ही रिश्ता पक्का किया है,\n   कम से कम वो रोज़ तो मिलने आती है,\n   और दिल से सुकून भी देती है।",
                            " ज़िंदगी का असली मज़ा तो मस्ती में है,\n   जो हर बात पे मुस्कुराए वही सच्चा बंदा है,\n   वरना तो टेंशन सबको है,\n   हँसी बाँटने वाला ही असली हीरो है।",
                            " भगवान ने इंसान बनाया,\n    उसमें हँसी का फंक्शन भी डाला,\n    अब जो इस फंक्शन को यूज़ नहीं करता,\n    वो ज़िंदगी में ‘Error 404 – Fun Not Found’ कहलाता!"
                        )
                        val dardShayari = arrayOf(
                            " दर्द क्या होता है कोई उस शख़्स से पूछे,\n   जो हँसते हुए भी हर रोज़ रोता है,\n   जिसे हर रात तन्हाई रुलाती है,\n   और हर सुबह वो ज़ख्म छुपा लेता है।",
                            " ना पूछो हाल मेरा,\n   दिल की हालत खराब है,\n   हर मुस्कान के पीछे छुपा,\n   एक अधूरा ख्वाब है।",
                            " दिल टूटने की आवाज़ नहीं होती,\n   लेकिन इसकी गूंज सारी ज़िंदगी सुनाई देती है,\n   कोई क्यों समझेगा दर्द हमारा,\n   यहाँ तो लोग मुस्कराहट पर भी सवाल करते हैं।",
                            " कितना भी छुपा लो दर्द को,\n   चेहरे से जाहिर हो ही जाता है,\n   हर कोई पूछता है क्या हुआ?\n   और हम हर बार मुस्कुरा जाते हैं।",
                            " दर्द लिखूं तो लफ्ज़ भी रो पड़ें,\n   आंसुओं में बह जाए हर दास्ताँ,\n   ये दिल अब खुद से ही डरता है,\n   फिर किसी अपने से टूट जाने की वजह से।",
                            " वो कभी मेरे आंसुओं की वजह थे,\n   आज मुस्कान बनकर याद आते हैं,\n   वक़्त के साथ सब बदल जाता है,\n   लेकिन कुछ जख्म हैं जो रह जाते हैं।",
                            " तन्हाई में जब कोई पास नहीं होता,\n   तब दिल बहुत उदास होता है,\n   जी चाहे कि किसी से बात कर लें,\n   लेकिन किससे? जब कोई खास नहीं होता।",
                            " दर्द वो नहीं जो आंसुओं से बहता है,\n   दर्द वो है जो चुपचाप सहा जाता है,\n   जिसे कोई समझ न पाए,\n   वही तो असली दर्द कहलाता है।",
                            " दिल के किसी कोने में अब भी यादें बसती हैं,\n   जो हर रात आँखों से आंसू बनकर निकलती हैं,\n   ना जाने क्यों हम इतने बेबस हैं,\n   कि अब दर्द में भी मुस्कराहट ढूंढते हैं।",
                            " जो दिल को छू जाए वही बात करते हैं,\n    दर्द हो चाहे ख़ुशी, जज़्बात करते हैं,\n    हम तो वो हैं जो टूट कर भी,\n    सबसे पहले अपनों की ही फ़िक्र करते हैं।"
                        )
                        val bewafaShayari = arrayOf(
                            " किसी की बेवफाई का इतना अफ़सोस न कर,\n   जो चला गया वो खुद अपने नसीब का रोएगा,\n   तू तो फिर भी सच्चे दिल से निभाता रहा,\n   पर वो झूठी मोहब्बत में खोएगा।",
                            " दिल से निभाई थी हमने मोहब्बत,\n   पर शायद किस्मत को मंजूर नहीं था,\n   वो बेवफा निकला कोई बात नहीं,\n   मगर दर्द अब भी कम नहीं होता।",
                            " वो जो कहते थे हमसे कभी जान हो तुम,\n   आज वही कहते हैं पहचान कौन?\n   बेवफाई भी इस अंदाज़ में की उन्होंने,\n   कि अब खुद से भी शर्म आती है।",
                            " उसकी यादों को भुलाना मुश्किल है,\n   अब तो मुस्कुराना भी मुश्किल है,\n   जिसको चाहा था टूट कर हमने,\n   उसी की बेवफाई को भुलाना मुश्किल है।",
                            " एक दिन खुद ही रोएंगे वो मेरी याद में,\n   जब जान लेंगे कि क्या था प्यार हमारा,\n   मगर तब तक बहुत देर हो चुकी होगी,\n   क्योंकि अब हम भी बदल चुके होंगे सारा।",
                            " दिल तोड़ दिया उसने बड़ी सादगी से,\n   पहले तो हँस के मिलते रहे,\n   फिर धीरे-धीरे दूर हो गए,\n   और हम सोचते रह गए – गलती क्या थी हमारी।",
                            " जो तेरे बिना अधूरे थे,\n   अब तेरे साथ भी अधूरे लगे,\n   तूने जो जख्म दिए दिल को,\n   वो अब जख्म नहीं आदत बन गए।",
                            " हमने चाहा तुझको हर हाल में,\n   और तूने छोड़ा हमें बेहाल में,\n   तेरी वफ़ा ने जो सिखाया हमें,\n   अब किसी पर ऐतबार नहीं करते हम इस जमाल में।",
                            " बेवफाई का इल्ज़ाम तुझ पर नहीं,\n   हमारी मोहब्बत पर है,\n   जो तुझ जैसे को हमने दिल दिया,\n   यही सबसे बड़ी भूल है।",
                            " अब तुझसे कोई शिकवा नहीं,\n    तू जो भी था बस किस्सा था,\n    तुझे भूलने में वक्त लगेगा जरूर,\n    पर अब तू मेरे लिए सिर्फ एक हिस्सा था।"
                        )
                        val yaadShayari = arrayOf(
                            " हर रोज़ ये सोच कर सोते हैं,\n   कि भूल जाएंगे तुझे,\n   मगर आंखें बंद करते ही,\n   तेरी यादें दिल को जगा जाती हैं।",
                            " तुम्हारी यादों का सहारा है अब,\n   वरना कौन अपना हमारे पास है,\n   हर लम्हा तुझसे जुड़ा लगता है,\n   जैसे दिल की हर धड़कन में तू खास है।",
                            " जब भी तन्हा होता हूँ,\n   तेरी यादें पास आ जाती हैं,\n   यूँ लगता है जैसे तू यहीं है,\n   और मेरी तन्हाई मुस्कुरा जाती है।",
                            " भूल जाने को कहा था तुमने,\n   लेकिन याद करना आदत बन गई,\n   अब तो हर घड़ी तुझे सोचना,\n   मेरी ज़िंदगी की इबादत बन गई।",
                            " वो लम्हें भी क्या खूब थे,\n   जब हम साथ चला करते थे,\n   अब तो बस यादें रह गई हैं,\n   जो हर रात सिला करती हैं।",
                            " एक तेरी यादें ही तो हैं,\n   जो रोज़ मुझसे मिलने आती हैं,\n   वरना इस तनहाई में,\n   ना कोई ख्वाब, ना हकीकत नजर आती है।",
                            " तेरी यादों में हम इतना खो जाते हैं,\n   हर शाम को तन्हा रो जाते हैं,\n   ना जाने कब मिलेगी तुझसे राहत,\n   हम तेरे बिना अधूरे से हो जाते हैं।",
                            " तेरी यादों का असर कुछ यूं है,\n   नींद भी अब रुक-रुक कर आती है,\n   ख्वाबों में जो तू नजर आ जाए,\n   तो रात अपनी सी लग जाती है।",
                            " तुमसे बिछड़ कर भी हम,\n   हर रोज़ तुझसे मिलते हैं,\n   यादों की उस गली में,\n   हर लम्हा तुझे महसूस करते हैं।",
                            " ये दिल तुझसे बिछड़ कर भी,\n    तुझे भुला ना सका,\n    हर धड़कन में तू बसा है,\n    तेरे बिना कोई और अच्छा लगा ही नहीं।"
                        )
                        val ishqShayari = arrayOf(
                            " इश्क़ में दिल लगाना जरूरी है,\n   लफ़्ज़ों से ज्यादा कुछ महसूस करना जरूरी है,\n   इस प्यारे से रिश्ते में खुद को खो देना,\n   और खुद को फिर से पा लेना जरूरी है।",
                            " इश्क़ एक जज़्बा है जो हर किसी को नहीं मिलता,\n   यह दिल की गहराई से महसूस होता है,\n   जब किसी को दिल से चाहो तो,\n   यह सच्चाई बन जाता है।",
                            " इश्क़ क्या है, कुछ समझ में नहीं आता,\n   दिल में ख्वाहिशें बहुत होती हैं,\n   मगर उसकी एक हंसी से,\n   हर दर्द सहना आसान हो जाता है।",
                            " इश्क़ में जो खो जाता है,\n   वो कभी नहीं पाता फिर खुद को,\n   मगर जो खुद को खोकर इश्क़ पा लेते हैं,\n   उनकी दुनिया ही बदल जाती है।",
                            " इश्क़ एक खूबसूरत सा ख्वाब है,\n   जो आँखों से आँखों में बस जाता है,\n   दिल की चाहत बन कर,\n   वो फिर कभी दूर नहीं जाता है।",
                            " इश्क़ का रंग सबसे अलग है,\n   यह दिल को हर दर्द से मुक्त करता है,\n   जब किसी को सच्चे दिल से चाहो,\n   तो इश्क़ अपने आप सजता है।",
                            " इश्क़ नहीं, मोहब्बत से जीते हैं हम,\n   तुझसे दूर होने का ख्याल भी नहीं सहते हैं हम,\n   तेरे बिना जीना तो क्या,\n   अपना नाम तक भूल जाते हैं हम।",
                            " इश्क़ का रंग चाँद सा है,\n   जो रातों को अपनी रोशनी देता है,\n   जैसे उसकी आँखों में खो कर,\n   दिल अपना आराम पाता है।",
                            " इश्क़ की राह में बहुत दर्द है,\n   लेकिन जब दिल सही साथी चुन लेता है,\n   तो यही दर्द सुकून सा लगता है,\n   क्योंकि वही इश्क़ सच्चा होता है।",
                            " इश्क़ करना खुद से नहीं,\n    किसी और से जुड़ने का नाम है,\n    जब दिल दो दिलों से मिलते हैं,\n    तभी समझ आता है इश्क़ का सच्चा ख़्वाब।"
                        )
                        val tanhaiShayari = arrayOf(
                            " जब से तू दूर हुआ है,\n   दिल में एक सन्नाटा सा गूंजता है,\n   लोगों के बीच रहते हुए भी,\n   एहसास होता है सिर्फ तन्हाई का।",
                            " तन्हाई में हम अक्सर खुद से बात करते हैं,\n   अपनी यादों में खोकर कुछ पल बिताते हैं,\n   ज़िंदगी के हर राज को जानते हुए,\n   फिर भी अकेलेपन को अपनाते हैं।",
                            " तेरी यादें बहुत करीब हैं,\n   अब कोई दिलासा नहीं चाहिए,\n   तन्हाई का अपना ही मज़ा है,\n   किसी और की अब तलाश नहीं चाहिए।",
                            " एक ख़ामोशी सी सीने में बसी है,\n   तन्हाई हर पल पास में रही है,\n   किसी से कुछ कहना अब नहीं है,\n   क्योंकि दिल की आवाज़ दिल के पास ही रही है।",
                            " हमसे ना पूछो, क्यों कुछ नहीं कह रहे,\n   शब्द भी अब शायद तन्हाई के डर से डर रहे,\n   एक अकेलेपन की गहरी रात हो गई है,\n   और हम फिर भी इस अंधेरे में जा रहे हैं।",
                            " रातों को अक्सर मैं खुद से बातें करता हूँ,\n   अकेले में ही अपने दर्द को समझता हूँ,\n   सब कुछ सही होते हुए भी,\n   अंदर ही अंदर तन्हाई को महसूस करता हूँ।",
                            " तन्हाई में खुद को ढूंढता हूँ,\n   एक वक्त के बाद खुद से ही डरता हूँ,\n   जब से तू दूर हुआ है,\n   हर दिन सिर्फ यादों में जीता हूँ।",
                            " जब अकेला होता हूँ, तो बहुत कुछ याद आता है,\n   तन्हाई में और भी सब कुछ गहरा सा लगता है,\n   कुछ लोगों की यादें बहुत दर्द देती हैं,\n   पर फिर भी, वो हमेशा हमारे दिल के पास रहती हैं।",
                            " चुप रहने का अब भी यही वजह है,\n   क्योंकि तन्हाई से मिलने वाली राहत का अलग ही असर है,\n   शोर से न जाने क्यों लगता है डर,\n   अकेले में सुकून मिलता है, ऐसा क्या है असर।",
                            " हम भी अब तन्हाई में खुद को बिखरते हैं,\n    दर्द को अपनी ज़िंदगी का हिस्सा मानते हैं,\n    शायद यही हमारी सजा है,\n    जो हम कभी समझ नहीं पाते हैं।"
                        )
                        val goodMorningShayari = arrayOf(
                            " सुबह की किरण है तेरे चेहरे पे मुस्कान,\n   तेरी हँसी में है दुनिया की जान,\n   इस नए दिन की शुरुआत हो खुशियों से,\n   गुड मॉर्निंग हो तुझे हमेशा मुस्कान से।",
                            " सुबह का सूरज तेरे चेहरे पे मुस्काए,\n   तेरे सपने सच्चे हो, यही दुआ है हमारी,\n   नई सुबह लाए खुशियाँ तेरे जीवन में,\n   और हर दिन हो तू खुशहाल, गुड मॉर्निंग मेरी यारी।",
                            " ख्वाबों से भी प्यारी हो सुबह तेरी,\n   जैसे खुशबू हो बर्फ़ में पिघलती हुई,\n   भगवान से यही दुआ है हम हमेशा,\n   तेरा हर दिन हो ख़ुशियों से खिलता हुआ।",
                            " सूरज की किरण से पहले तेरा चेहरा याद आया,\n   एक प्यारी सी हँसी से दिन का आगाज किया,\n   हम चाहते हैं हर दिन तेरा हो खास,\n   गुड मॉर्निंग, खुश रहो तुम हर पल, हर घड़ी।",
                            " सुबह की रोशनी में तेरी यादें हैं बसी,\n   हरे-भरे मौसम में तेरी ख़ुशबू सी,\n   तेरी मुस्कान से महकते हैं ये दिन,\n   गुड मॉर्निंग हो, खुश रहें हम सभी।",
                            " हंसी तेरी जैसे रौशनी हो सुबह की,\n   तेरे बिना दिन हो जैसे बिना रंग की,\n   हर सुबह तेरे साथ बिताने की ख्वाहिश है,\n   गुड मॉर्निंग हो तुम्हें, हमेशा खुसहाल रहो तुम।",
                            " जैसे सूरज की किरण में छुपा हो प्यार,\n   वैसे ही तुम्हारे चेहरे पे हर सुबह हो ख़ुशियाँ बेहिसाब,\n   तेरा दिन हो रोशन, सजे जिंदगी का हर पल,\n   गुड मॉर्निंग! तुम्हारे जीवन में हो खुशियाँ ही खुशियाँ।",
                            " हर सुबह नई उम्मत के साथ जागो,\n   अपनी मेहनत से ज़िंदगी को सजाओ,\n   हमेशा हंसते रहो तुम, कभी न रुको,\n   गुड मॉर्निंग हो तुम्हें, बढ़ते रहो तुम।",
                            " सूरज की किरने से पहले तेरी यादों का असर है,\n   तुम्हारी मुस्कान ही है जो हमें आगे बढ़ने का साहस है,\n   हर सुबह तेरे बिना अधूरी सी लगती है,\n   गुड मॉर्निंग, तू हर दिन खुश रहे।",
                            " हर सुबह एक नई उम्मीद लेकर आती है,\n    साथ में खुशियाँ और प्यार की सौगात लाती है,\n    तेरा दिन हो खुशियों से भरा, यही है मेरी दुआ,\n    गुड मॉर्निंग! रहे हर सुबह तेरी मुस्कान।"
                        )
                        val goodNightShayari = arrayOf(
                            " रात की चाँदनी तुम्हारे सपनों को सजे,\n   हर ख्वाब तुम्हारा हकीकत में बदले,\n   अब हम सो रहे हैं चैन से,\n   तुम भी सो जाओ, सुकून से।",
                            " चाँद और तारे हैं तुम्हारे साथ,\n   तुम्हारे ख्वाबों में खो जाए रात,\n   इस प्यारी सी रात में मेरी दुआ है,\n   तुम्हारी रात भी हो हसीन, तुम भी हो खुश।",
                            " चाँद की चाँदनी रातों में,\n   यादों की मीठी बातें हों,\n   दिल में बस तुम हो हमेशा,\n   ख्वाबों में तुम मेरे पास हो।",
                            " इस प्यारी सी रात में एक दुआ है,\n   मेरे ख्वाबों में तुम सदा बस रहो,\n   चाँद की रोशनी में बसी रहे खुशियाँ,\n   और मेरी दुआ तुम तक हमेशा पहुंचे।",
                            " जब चाँद की चाँदनी हो रात में,\n   तुमको महसूस हो मेरी बात में,\n   तुम्हें याद आऊँ मैं इस पल में,\n   और तुम्हारे दिल में एक नाम हो हमेशा।",
                            " तुम सोचो तो मैं तुमसे मिलने आऊँ,\n   तुम सोने की कोशिश करो तो मैं ख्वाब बन जाऊँ,\n   पर जब तुम सो जाओ, खुदा से दुआ है,\n   तुम हर रात चैन से सो जाओ।",
                            " अब सो जाओ तुम अपनी मीठी नींद में,\n   अपने ख्वाबों में खो जाओ तुम,\n   जैसे चाँद ने किया सूरज से प्यार,\n   वैसे ही तुम्हारा दिल मिले किसी खास से।",
                            " हर रात में चाँद तुझे देखे,\n   और खुदा से तेरी खुशियाँ माँगे,\n   इस रात की चाँदनी में सुकून पाओ,\n   और हर ख़्वाब साकार हो।",
                            " रात आई है, सितारे भी चमक रहे हैं,\n   चाँद भी तुमसे मिलने को तैयार है,\n   इस रात को सहेज कर रखना,\n   अगली सुबह तक तुम मेरे ख्वाबों में रहना।",
                            " मैं चाहूँगा तुम्हें रात भर ख्वाबों में,\n    तुम सोते रहो खुदा से दुआ है,\n    तुम जैसे हो वैसे रहो हमेशा,\n    और हर रात तुम्हारी प्यारी हो।"
                        )
                        val janmdinShayari = arrayOf(
                            " तुझसे बड़्ा कोई नहीं, यही सच है,\n   तेरी मुस्कान में जो दम है, वही खास है,\n   जन्मदिन मुबारक हो तुम्हें,\n   इस नए साल में हर दिन तेरा खास हो।",
                            " खुश रहें तुम हमेशा इसी तरह,\n   दिल में प्यार और चेहरे पर हंसी हमेशा रहे,\n   जन्मदिन की ये खास घड़ी,\n   तुम्हारे लिए हमेशा यादगार रहे।",
                            " रब से मेरी दुआ यही है,\n   तेरी जिंदगी खुशियों से भरी रहे,\n   हर दिन तेरा सबसे प्यारा हो,\n   तेरा हर कदम सफलता की ओर बढ़े।",
                            " जन्मदिन के इस खास दिन पर,\n   ढेर सारी खुशियाँ तुम्हारे साथ हों,\n   सच्चे प्यार और दिल से दुआ की जाती है,\n   तुम हमेशा खुश रहो यही हमारी उम्मीद हो।",
                            " प्यारी सी मुस्कान हो तुम्हारे चेहरे पर,\n   खुश रहो तुम दिल से हमेशा,\n   भगवान से हमारी यही दुआ है,\n   तुम्हारी जिंदगी हर पल खुशियों से भरी रहे।",
                            " जन्मदिन मुबारक हो आपको,\n   सभी ख्वाहिशें पूरी हो आपकी,\n   जीवन में प्यार हो ऐसा,\n   जैसे किसी किताब की खूबसूरत कहानी हो आपकी।",
                            " चाँद सितारे भी तुम्हारे सामने फीके हैं,\n   तुम्हारी मुस्कान से तो ज़माना जागता है,\n   जन्मदिन की ढेर सारी शुभकामनाएँ,\n   तुम हमेशा वैसे ही प्यारे और खुश रहो।",
                            " आज का दिन है बेहद खास,\n   खुशियों से भरी हो ये राह,\n   जन्मदिन पर यही दुआ है मेरी,\n   सफलता का चाँद हमेशा चमके तुम्हारे पास।",
                            " जन्मदिन पर मिले खुशियाँ हर पल,\n   सुख, शांति और समृद्धि से हो आप सजा,\n   भगवान से दुआ है यही,\n   आपका हर दिन हो और भी खास।",
                            " आपके जन्मदिन पर ढेर सारी बधाईयाँ,\n   प्रेम और खुशियों की हो भरमार,\n   जीवन के हर मोड़ पर सफलता मिले,\n   आपकी मुस्कान हो कभी न हो दूर।"
                        )
                        val barishShayari = arrayOf(
                            " बारिश की बूँदें गिरीं हैं आज,\n   तुझे याद किया है दिल ने कुछ खास,\n   तेरे बिना हर पल अधूरा सा लगता है,\n   तू हो तो मौसम भी सुहाना सा लगता है।",
                            " बारिश की रातों में यादें भी ताजगी ले आती हैं,\n   तेरे बिना तो दिल भी बुझ सा जाता है,\n   कभी एक साथ बैठकर बारिश को देखो,\n   तो एहसास होता है हम सच्चे थे तुम्हारे।",
                            " जब बारिश होती है तो तुम्हारी यादें और बढ़ जाती हैं,\n   वो पल भी कुछ खास होते हैं,\n   जब बारिश की बूँदें तेरे साथ चूमती हैं,\n   और हम खामोश बैठे रहते हैं।",
                            " बारिश की बूंदों में दिल डूब जाता है,\n   हर याद तेरी ही याद बन जाती है,\n   जैसे बारिश हर ग़म को धो देती है,\n   वैसे ही तुझसे मिलकर मैं भी खुश हो जाता हूँ।",
                            " बारिश की बूँदों में कभी तुम्हें महसूस किया,\n   तो कभी अपनी यादों में खो गया,\n   अब तो बारिश का हर पल तुम्हारे नाम से जुड़ने लगा,\n   और दिल से आवाज़ दी तुम्हें फिर से वापस आ।",
                            " बारिश की हर बूँद को तेरे करीब महसूस किया,\n   सर्द हवा में भी तेरे बिना तन्हा महसूस किया,\n   दिल को जैसे अब सिर्फ तुम्हारी ही तलाश है,\n   ये बारिश मेरे दिल का तूफान बना देती है।",
                            " बारिश का पानी छूने से पहले,\n   दिल में एक सवाल आया,\n   क्या तू भी इसी बारिश में खोया था कभी,\n   जैसे मैं तेरी यादों में खोया हूँ।",
                            " बारिश की बूँदें जब तेरे चेहरे पे पड़ें,\n   तो हर ग़म भी मुझसे दूर हो जाए,\n   उस बारिश के मौसम में एक नई कहानी हो,\n   जहाँ मैं और तुम साथ चलें।",
                            " बारिश का हर पल तेरी यादों का एक हिस्सा बन जाता है,\n   जैसे बूँदें खुद को समेट कर एक साथ आते हैं,\n   वैसे ही दिल में तेरे ख्यालों का सैलाब उठता है।",
                            " बारिश की हल्की-सी बूँदें दिल को सुकून देती हैं,\n    जैसे तेरी यादों का हर पल ताजगी का अहसास कराती हैं,\n    तेरे बिना मौसम फीका सा लगता है,\n    बारिश से भी ज़्यादा तुझसे मिलने की तमन्ना बढ़ जाती है।"
                        )
                        val jeevanShayari = arrayOf(
                            " जीवन के हर मोड़ पर एक नई कहानी होती है,\n   हर दर्द में भी एक मुस्कान होती है,\n   यह ज़िंदगी कोई आसान राह नहीं,\n   पर सच्चे इरादे में जान होती है।",
                            " जीवन की राहों में कभी सुख तो कभी दुख आता है,\n   पर जो सच्चे दिल से जीते हैं,\n   वही हर मोड़ पर खुशी को पाते हैं।",
                            " ज़िंदगी एक किताब की तरह होती है,\n   हर पन्ने में कुछ नया लिखा जाता है,\n   जब तक हम खुश रहें,\n   हर अध्याय में एक नई रोशनी आती है।",
                            " जीवन में चुनौतियाँ हर किसी के सामने आती हैं,\n   पर जो कभी हार न मानें,\n   वही सचमुच विजयी कहलाते हैं।",
                            " जिंदगी में कभी कोई रास्ता बंद नहीं होता,\n   बस कुछ वक्त बाद नया रास्ता खुलता है,\n   और उसी रास्ते पर हर इंसान को\n   एक नई मंजिल मिलती है।",
                            " जीवन जीने का तरीका अपना लो,\n   न किसी से डरें न किसी से हारें,\n   जो खुद को पहचान सके,\n   वही असली जीवन जीने वाला कहलाता है।",
                            " अगर तुम दुखों से घिरे हो तो घबराना मत,\n   जीवन में असली आनंद तो दुखों के बाद आता है,\n   ये परेशानियाँ तुम्हें और मजबूत बना देंगी,\n   बस इनसे डरो मत।",
                            " जीवन की सबसे बड़ी सच्चाई यही है,\n   हर पल बदलता है वक़्त,\n   यही वक़्त हमें बताता है,\n   कब हंसना है, कब रोना है।",
                            " जीवन में उतार-चढ़ाव तो आते हैं,\n   लेकिन उन्हें सहन कर ही हम आगे बढ़ते हैं,\n   हर कठिनाई हमें कुछ सिखा देती है,\n   जो अगले मोड़ पर काम आती है।",
                            " जब ज़िंदगी में दर्द मिले तो मुस्कराओ,\n    क्योंकि वही दर्द हमें सच्ची ताकत देता है,\n    जो हमारे आत्मविश्वास को बढ़ाता है,\n    और हमें नए रास्ते दिखाता है।"
                        )
                        val holiShayari = arrayOf(
                            " रंगों में डूबो के तुझे याद किया है,\n   तेरे बिना होली का क्या काम किया है,\n   दिल से दुआ है तुम्हारे लिए,\n   यह होली तुम्हारे लिए ख़ास किया है।",
                            " होली के इस रंगीन मौसम में,\n   खुशियों का रंग और प्यार का रंग हो,\n   दिलों में सच्ची मोहब्बत का रंग हो,\n   यही रंग होली का असली रंग हो।",
                            " रंगों से बुरा कोई नहीं होता,\n   पर कोई होली से पहले थोड़ा संभल कर खेलता है,\n   हम तो दिल से होली मनाते हैं,\n   हर रंग में एक प्यार का रिश्ता होता है।",
                            " होली आई है रंगों का त्योहार है,\n   दिलों में प्रेम और भाईचारे का विचार है,\n   हर चेहरे पे हंसी और खुशी का रंग है,\n   इस होली को हर कोई प्यार से रंगे।",
                            " इस होली रंगों की तरह खिलो,\n   हर रंग में मोहब्बत का रंग घोलो,\n   दिलों में खुशियों के रंग भर दो,\n   और हर मुस्कान में एक नई दुनिया बसा दो।",
                            " जब तक होली न खेलो, तब तक रंगों की बात करो,\n   जब रंग बिखेरो तो सबको हंसी की सौगात दो,\n   इस होली हर दिल में खुशी हो,\n   यही हमारी दुआ है इस बार की होली को।",
                            " रंगों में खो जाना है इस बार,\n   होली के रंगों में मिलकर हर दिल हो उजियार,\n   प्यार से रंगी हो यह दुनिया हमारी,\n   होली का पर्व लाए खुशियाँ सारी।",
                            " होली आई है, दिलों में रंगीनियत लाई है,\n   एक नई उम्मीद की नमी और मुस्कान छाई है,\n   हर दिल में रंग बिखरे, हर रंग में प्यारी यादें,\n   होली के इस मौके पर मिलकर खुशियाँ बांटे।",
                            " रंगों से नहीं दिलों से खेलो,\n   इस होली हर एक को प्यार से रंग दो,\n   होली में असली रंग उस वक़्त दिखाई देते हैं,\n   जब दिल से दिल मिल जाते हैं।",
                            " होली के रंगों में प्यार हो,\n    दोस्ती और रिश्तों का नया सफ़र हो,\n    इस बार होली में दिलों की बात हो,\n    और हर रंग में हमारी दुआ हो।"
                        )
                        val eidShayari = arrayOf(
                            " खुशियाँ हों हर दिन आपकी ज़िंदगी में,\n   ईद के दिन की तरह रौशन हो आपकी जिंदगी,\n   दुनिया की सारी खुशियाँ आपके कदमों में हो,\n   और हर ख्वाब आपका सच हो इस ईद पर।",
                            " ईद की इस ख़ास रात में,\n   दुआ है हमारी आपके साथ में,\n   आपका हर सपना पूरा हो इस साल,\n   और ज़िंदगी में खुशियाँ हों भरपूर इस ईद।",
                            " ईद आई है खुशियाँ लेकर,\n   लाए हर दिल में प्यार का असर,\n   हर दर्द को खत्म कर दे ये दिन,\n   और खुशियाँ हो हर ओर बिखेर।",
                            " ईद का त्यौहार खुशियाँ लाए,\n   आपका हर ग़म खुशी में बदल जाए,\n   इस ईद पर दुआ हमारी बस ये हो,\n   हर एक दिल में प्यार और सुख भर जाए।",
                            " दिलों में बस जाए मुहब्बत का रंग,\n   और हर ओर फैल जाए खुशियों का संग,\n   इसी तरह हर साल ईद आए,\n   और खुशियाँ लेकर आपके पास आए।",
                            " इस ईद के दिन मिले ढेर सारी खुशियाँ,\n   सब ग़म आपके दूर हो जाए,\n   मुस्कान हो आपकी हमेशा बनी रहे,\n   और ये दिन हमेशा याद रहे।",
                            " ईद की ये सुबह खुशियाँ लाए,\n   साथ हर दर्द को छोड़ जाए,\n   दुआ है हमारी कि ईद की रौनक,\n   आपके जीवन को हमेशा सजाए।",
                            " मोहब्बत और खुशियाँ इस ईद में मिले,\n   हर ग़म, हर दर्द दूर हो जाए,\n   इस पाक दिन पर हो सबके दिलों में प्यार,\n   और सारी दुनिया खुशहाल हो जाए।",
                            " ईद के इस मौके पर दुआ है हमारी,\n   हर दिन आपका हो जश्न-ए-ईद की तरह प्यारी,\n   सजी रहे खुशी और प्यार से हर सुबह,\n   और हर रात में मुस्कान हो आपकी ज़िंदगानी।",
                            " ईद का त्यौहार लाए ढेर सारी खुशी,\n    रंग-बिरंगे फूलों की महक जैसी,\n    आप हर साल ऐसे खुश रहो,\n    जैसे ईद की खुशियाँ बसी हो आपकी ज़िंदगी में।"
                        )
                        val nayaSaalShayari = arrayOf(
                            " नया साल है, नए सपने हैं,\n   खुशियों के साथ जिंदगानी सजे,\n   हर दिन आपका हो खुशहाल,\n   हो बेमिसाल आपका नया साल।",
                            " बीते साल की सभी दुखों को छोड़ दो,\n   नये साल के साथ नए खुशियों को जोड़ दो,\n   हर दिन, हर पल, आपकी ज़िन्दगी में हो ख़ुशियाँ,\n   यही दुआ है हमारे दिल की हर कोने से।",
                            " नये साल का ये प्यारा सा दिन,\n   लाए आपके जीवन में खुशियाँ जितनी दिल से चाहें,\n   हर दुःख से दूर, हर दर्द से पार,\n   हो आपका नया साल शानदार और बेकार।",
                            " इस नए साल में हो नई शुरुआत,\n   ढेर सारी खुशियाँ और मस्ती की बात,\n   हर सुबह हो नई उम्मीदों से भरी,\n   हर रात हो खुशी और सफलता से सजी।",
                            " हम आशीर्वाद देते हैं आपको इस नये साल में,\n   हर खुशी मिले और खुशियाँ हो भरपूर,\n   नये साल का हो यह रंगीन सफर,\n   हमेशा साथ रहें, सच्चे रिश्तों का दस्तूर।",
                            " साल नया है, उम्मीदें नई हैं,\n   मेहनत करने का वक्त फिर से आया है,\n   कोई भी ख्वाब हो, साकार करो,\n   नया साल तो है बस एक बहाना, जी भर के जी लो।",
                            " नया साल लेकर आया है ढेर सारी खुशियाँ,\n   हो आशीर्वाद से भरी आपकी तीजियाँ,\n   नयी उम्मीदें, नयी राहें मिलें,\n   और हर मुश्किल से बचके आप निकलें।",
                            " इस नये साल में हर दिन हो प्यार से भरा,\n   सुख, समृद्धि से हर मोड़ पर सामना हो,\n   कामयाबी की ऊँचाई हो, हर ख्वाब पूरा हो,\n   आप अपने जीवन में कभी न हारें, यही शुभकामना हो।",
                            " बीते साल के ग़म को छोड़ दो,\n   नए साल में नई खुशी जोड़ दो,\n   यह साल लाए आपके लिए ढेर सारी राहत,\n   खुश रहें आप, यही हमारी है दुआ।",
                            " नया साल है, खुशियाँ लाए,\n   सफलता का रास्ता और आसान बनाए,\n   परिवार में प्यार और दोस्ती हो गहरी,\n   नये साल में सुख, समृद्धि हो सारी दुनिया से बड़ी।"
                        )
                        val rajnitiShayari = arrayOf(
                            " राजनीति के खेल में सब कुछ जायज़ है,\n   वादे झूठे होते हैं, नफरत भी सही है,\n   जनता के दर्द को अनसुना किया जाता है,\n   और वही नेता अक्सर सबसे प्यारे होते हैं।",
                            " सत्ता की कुर्सी पर बैठने वाला,\n   जनता के दर्द को भूल जाता है,\n   जब तक लोग आँखें नहीं खोलते,\n   तब तक हर नेता वही बातें करता है।",
                            " हर चुनाव में नेता बड़ा हो जाता है,\n   जनता का दुख तो छोटा हो जाता है,\n   सत्ता में बैठे लोग कहते हैं सब ठीक है,\n   लेकिन जनता के सवाल कभी सुलझते नहीं हैं।",
                            " राजनीति में सच्चाई नहीं मिलती,\n   अपनों से ज्यादा अपने फरेब करते हैं,\n   जनसेवा की बात करने वाले,\n   खुद के स्वार्थ में सबसे आगे रहते हैं।",
                            " लोकतंत्र में हर किसी को आवाज़ मिलती है,\n   लेकिन गरीब की आवाज़ अब भी नहीं सुनाई देती,\n   नेता केवल अच्छे वादों के साथ आते हैं,\n   पर हकीकत में कुछ नहीं बदलता है।",
                            " राजनीति के जादू में सब फंसे हुए हैं,\n   नेता गरीबों के नाम पर कई वादे करते हैं,\n   लेकिन चुनावी जीत के बाद,\n   उन वादों को कोई याद नहीं करता।",
                            " सत्ता के खेल में हर कोई चाहता है जीत,\n   लेकिन वो भूल जाता है कि जनता की आँखों में रेत,\n   कभी झूठ नहीं छिप सकता,\n   एक दिन वो उखड़ कर सामने आता है।",
                            " चुनाव जीतने के बाद कौन जनता के पास जाता है,\n   नेताओं के पास तो सिर्फ सत्ता का ख्वाब होता है,\n   जिस दिन लोग समझेंगे इस खेल को,\n   उस दिन असल बदलाव होगा इस देश में।",
                            " राजनीति का रास्ता किचड़ से होकर गुजरता है,\n   हर नेता अपनी कुर्सी के लिए लड़ता है,\n   लेकिन सच तो यह है कि,\n   जो जनता को समझता है वही जीतता है।",
                            " हर बार चुनावी वादे पूरे नहीं होते,\n    जब तक लोग जागरूक नहीं होते,\n    राजनीतिक दल केवल अपना फायदा चाहते हैं,\n    और सच्चे बदलाव की आवश्यकता हम सब को होती है।"
                        )
                        val breakupShayari = arrayOf(
                            " दिल के रिश्ते टूट गए,\n   तेरे बिना जीने के तरीके खोज रहे हैं,\n   कभी लगता है तू साथ हो,\n   कभी फिर एहसास होता है कि सब खो चुके हैं।",
                            " तेरी यादों ने दिल को रुलाया,\n   तेरे जाने ने हमें अकेला किया,\n   अब तो हर ख्वाब अधूरा सा लगता है,\n   क्योंकि तू अब मेरी ज़िंदगी का हिस्सा नहीं रहा।",
                            " ब्रेकअप के बाद भी तेरी आदतें नहीं जाती,\n   अब भी हर सुबह तुझे ही ढूंढते हैं,\n   तेरे बिना ये दिल, ये सांसें,\n   जैसे टूटकर बिखर जाती हैं।",
                            " कभी सोचता हूँ कि क्यों तोड़े थे रिश्ते,\n   फिर याद आता है तेरा वो धोखा,\n   दिल टूटने के बाद यही समझ आया,\n   कुछ बातें कभी नहीं जुड़ती।",
                            " हमने खुद को तोड़कर तुझसे प्यार किया,\n   और तुमने हमें सिर्फ दुख दिया,\n   अब तो बस यही ख्याल आता है,\n   क्या सच में किसी से प्यार करना सही था?",
                            " दर्द से डरते थे हम कभी,\n   अब दर्द से मोहब्बत सी हो गई है,\n   तुमसे मिले थे हम ख्वाबों में,\n   अब तो इन ख्वाबों को भी भूल चुके हैं।",
                            " जब तक तुम थे पास,\n   सब कुछ सही था,\n   अब जब तुम दूर हो,\n   तो दिल में खालीपन है,\n   जिसे कोई भर नहीं सकता।",
                            " रिश्ता टूटा, दिल टूट गया,\n   अब तो हम अकेले हो गए,\n   तुम्हारा प्यार हमसे चला गया,\n   और हम सिर्फ यादों में खो गए।",
                            " तुम्हारा बिना बताये चले जाना,\n   ये दिल सह नहीं पाया,\n   हर पल तुम्हारी यादें मुझे तड़पाती हैं,\n   मगर अब हम तकदीर को क्या कह सकते हैं।",
                            " तुमसे प्यार करके खो दिया सब कुछ,\n    और अब तुमसे दूर होकर खुद को फिर से पा लिया,\n    अफसोस नहीं है उस रिश्ते का,\n    क्योंकि अब हमें अपनी ज़िंदगी फिर से मिली।"
                        )
                        val doLineDostiShayari = arrayOf(
                            " दोस्ती वो नहीं जो दर्द में साथ दे,\n   दोस्ती वो है जो खुशी में भी साथ दे।",
                            " सच्चे दोस्त कभी दूर नहीं होते,\n   वो हमेशा दिल में रहते हैं।",
                            " दोस्ती में अगर सच्चाई हो,\n   तो दूरी भी दिल से पास हो जाती है।",
                            " दोस्ती एक बंधन है जिसे दिल से निभाओ,\n   क्योंकि सच्चे दोस्त कभी नहीं टूटते।",
                            " दोस्ती से बढ़कर कोई खज़ाना नहीं,\n   ये वो रत्न है जो दिलों में चमकता है।",
                            " दोस्ती अगर सच्ची हो,\n   तो मुश्किलें भी आसान हो जाती हैं।",
                            " हमसे बुरा तो वो है,\n   जो दोस्ती के नाम पर धोखा देते हैं।",
                            " दोस्ती में कोई शर्त नहीं होती,\n   बस विश्वास और प्यार ही जरूरी होता है।",
                            " सच्चे दोस्त वो होते हैं,\n   जो मुसीबत में भी हाथ बढ़ाते हैं।",
                            " दोस्ती का हर पल अनमोल है,\n   यह वो खजाना है जो कभी नहीं खोता।"
                        )
                        val doLineShayari = arrayOf(
                            " दिल में ग़म हो तो चेहरे पे हंसी होती है,\n   जो खो जाता है, वही हमें बहुत कमी होती है।",
                            " कोई कहे प्यार है, कोई कहे दिल्लगी,\n   पर जो दिल से होता है, वही होती है सच्ची।",
                            " तेरे बिना क्या जीना, तेरे बिना क्या मरना,\n   तेरे बिना सब कुछ अधूरा, तेरे साथ सब कुछ पूरा।",
                            " वक्त भी सिखाता है, कुछ भी आसान नहीं,\n   जो पास होता है, वो कभी नहीं समझा जाता।",
                            " मोहब्बत के सफ़र में कुछ तो कमी रह जाती है,\n   पर दिल में छुपी एक यादें हमेशा रहती हैं।",
                            " जिनसे हम बेहद प्यार करते हैं,\n   वो ही अक्सर हमसे दूर हो जाते हैं।",
                            " ना जाने क्यों हमें ये दर्द अच्छा लगता है,\n   दिल में ग़म हो तो फिर जीना मुश्किल लगता है।",
                            " तेरे बिना क्या जीना, तेरे बिना क्या मरना,\n   प्यार के बिना तो हर रास्ता तन्हा लगता है।",
                            " यादें तो वही होती हैं जो दिल से जुड़ी हों,\n   जो वक्त के साथ नहीं बदलतीं, वही सच्ची होती हैं।",
                            " जिसको देख कर दिल में सुकून हो,\n   वही है प्यार, जो कभी कम नहीं होता।"
                        )
                        when (category) {
                            "प्रेम शायरी" -> {
                                shayari = premShayari
                            }

                            "दुःख शायरी" -> {
                                shayari = dukhShayari
                            }

                            "रोमांटिक शायरी" -> {
                                shayari = romanticShayari
                            }

                            "दोस्ती शायरी" -> {
                                shayari = dostiShayari
                            }

                            "क्रांतिकारी शायरी" -> {
                                shayari = krantikariShayari
                            }

                            "अटिट्यूड शायरी" -> {
                                shayari = attitudeShayari
                            }

                            "प्रेरणादायक शायरी" -> {
                                shayari = preranaShayari
                            }

                            "हंसी मजाक शायरी" -> {
                                shayari = hasiMazaakShayari
                            }

                            "दर्द शायरी" -> {
                                shayari = dardShayari
                            }

                            "बेवफा शायरी" -> {
                                shayari = bewafaShayari
                            }

                            "याद शायरी" -> {
                                shayari = yaadShayari
                            }

                            "इश्क शायरी" -> {
                                shayari = ishqShayari
                            }

                            "तनहाई शायरी" -> {
                                shayari = tanhaiShayari
                            }

                            "गुड मॉर्निंग शायरी" -> {
                                shayari = goodMorningShayari
                            }

                            "गुड नाइट शायरी" -> {
                                shayari = goodNightShayari
                            }

                            "जन्मदिन शायरी" -> {
                                shayari = janmdinShayari
                            }

                            "बारिश शायरी" -> {
                                shayari = barishShayari
                            }

                            "जीवन शायरी" -> {
                                shayari = jeevanShayari
                            }

                            "होली शायरी" -> {
                                shayari = holiShayari
                            }

                            "ईद शायरी" -> {
                                shayari = eidShayari
                            }

                            "नया साल शायरी" -> {
                                shayari = nayaSaalShayari
                            }

                            "राजनीति शायरी" -> {
                                shayari = rajnitiShayari
                            }

                            "ब्रेकअप शायरी" -> {
                                shayari = breakupShayari
                            }

                            "दो लाइन दोस्ती शायरी" -> {
                                shayari = doLineDostiShayari
                            }

                            "दो लाइन शायरी" -> {
                                shayari = doLineShayari
                            }
                        }


                        LazyColumn(
                            modifier = Modifier
                                .fillMaxSize()
                                .background(color = Color(0xFFE2F8E6)),
                            contentPadding = PaddingValues(5.dp)
                        ) {
                            items(shayari.size) {
                                Column(
                                    modifier = Modifier
                                        .fillMaxWidth()
                                        .padding(3.dp, 10.dp)
                                        .background(color = Color(0x8174E8EC))
                                ) {
                                    Row(modifier = Modifier.clickable {
                                        val intent = Intent(
                                            context, MainActivity3::class.java
                                        )
                                        intent.putExtra("category", category)
                                        intent.putExtra("shayari", shayari)
                                        intent.putExtra("shayarinumber", it)
                                        intent.putExtra("totalshayari", shayari.size)
                                        startActivity(intent)
                                        finish()
                                    }) {
                                        Text(
                                            text = shayari[it],
                                            fontSize = 20.sp,
                                            fontFamily = FontFamily(Font( R.font.playpensansdeva_medium)),
                                            color = Color.Black,
                                            lineHeight = 27.sp
                                        )
                                    }
                                    Row(
                                        modifier = Modifier
                                            .height(45.dp)
                                            .background(
                                                color = Color(0x9200ACC1)
                                            )
                                    ) {
                                        var isFavorite: Boolean by remember {
                                            mutableStateOf(
                                                favoriteShayari.contains(shayari[it])
                                            )
                                        }
                                        Button1(
                                            if (isFavorite) Color.Red else Color.Black,
                                            if (isFavorite) R.drawable.heart1 else R.drawable.heart,
                                            this
                                        ) {
                                            if (isFavorite) {
                                                favoriteShayari.remove(shayari[it])
                                            } else {
                                                favoriteShayari.add(shayari[it])
                                            }
                                            isFavorite = !isFavorite
                                            sp.edit {
                                                putStringSet("fshayari", favoriteShayari)
                                                apply()
                                            }
                                        }
                                        Button1(Color.Black, R.drawable.eye, this) {
                                            val intent = Intent(
                                                context, MainActivity5::class.java
                                            )
                                            intent.putExtra("shayari", shayari[it])
                                            startActivity(intent)
                                        }
                                        CopyShareWhatsApp(shayari[it], context, this)
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
}

/*
val sharedPreferences = getSharedPreferences("MY_PREFS", MODE_PRIVATE)
val savedText = sharedPreferences.getString(
    "favorite_text", ""
)

val newShayari = if (savedText!!.isNotEmpty()) {
    val shayariList = savedText.split("_0_")
    val shayariList1 = shayariList.toMutableList()
        .apply { add(shayari[it]) }
    shayariList1.joinToString(separator = "_0_")
} else {
    shayari[it]
}
sharedPreferences.edit {
    putString(
        "favorite_text", newShayari
    )
}*/
